; domain
(define (domain driverlog)
  (:requirements :typing :fluents) 
  (:types           location locatable - object
		driver truck obj - locatable)

  (:predicates 
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x  - location ?y - location) 
		(path ?x  - location ?y - location)
		(empty ?v - truck)
)
  (:functions 	
		(time-to-drive ?l1 - location ?l2 - location)
		(fuel-used)
		(fuel-per-minute ?t - truck)
		(load ?t - truck)
  )


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck) (increase (load ?truck) 1)
		(increase (fuel-per-minute ?truck) (+ (load ?truck) 1))))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc) (decrease (load ?truck) 1)
		(decrease (fuel-per-minute ?truck) (load ?truck))))


(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
		(increase (fuel-used) (* (fuel-per-minute ?truck) (time-to-drive ?loc-from ?loc-to)))))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))

 
)

; problem
(define (problem DLOG-3-5-15)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	package7 - obj
	package8 - obj
	package9 - obj
	package10 - obj
	package11 - obj
	package12 - obj
	package13 - obj
	package14 - obj
	package15 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	s7 - location
	s8 - location
	s9 - location
	s10 - location
	p0-5 - location
	p0-8 - location
	p1-0 - location
	p1-6 - location
	p2-5 - location
	p3-2 - location
	p4-1 - location
	p4-3 - location
	p4-9 - location
	p5-3 - location
	p5-7 - location
	p6-4 - location
	p8-0 - location
	p8-4 - location
	p8-10 - location
	p9-5 - location
	p9-6 - location
	p10-0 - location
	p10-7 - location
	)
	(:init
	(at driver1 s4)
	(at driver2 s0)
	(at driver3 s1)
	(at truck1 s9)
	(empty truck1)
	(= (load truck1) 0)
	(= (fuel-per-minute truck1) 10)
	(at truck2 s8)
	(empty truck2)
	(= (load truck2) 0)
	(= (fuel-per-minute truck2) 10)
	(at truck3 s9)
	(empty truck3)
	(= (load truck3) 0)
	(= (fuel-per-minute truck3) 10)
	(at truck4 s1)
	(empty truck4)
	(= (load truck4) 0)
	(= (fuel-per-minute truck4) 10)
	(at truck5 s4)
	(empty truck5)
	(= (load truck5) 0)
	(= (fuel-per-minute truck5) 10)
	(at package1 s10)
	(at package2 s0)
	(at package3 s6)
	(at package4 s2)
	(at package5 s2)
	(at package6 s7)
	(at package7 s5)
	(at package8 s1)
	(at package9 s1)
	(at package10 s1)
	(at package11 s2)
	(at package12 s2)
	(at package13 s4)
	(at package14 s5)
	(at package15 s2)
	(path s0 p0-5)
	(path p0-5 s0)
	(path s5 p0-5)
	(path p0-5 s5)
	(path s0 p0-8)
	(path p0-8 s0)
	(path s8 p0-8)
	(path p0-8 s8)
	(path s1 p1-0)
	(path p1-0 s1)
	(path s0 p1-0)
	(path p1-0 s0)
	(path s1 p1-6)
	(path p1-6 s1)
	(path s6 p1-6)
	(path p1-6 s6)
	(path s2 p2-5)
	(path p2-5 s2)
	(path s5 p2-5)
	(path p2-5 s5)
	(path s3 p3-2)
	(path p3-2 s3)
	(path s2 p3-2)
	(path p3-2 s2)
	(path s4 p4-1)
	(path p4-1 s4)
	(path s1 p4-1)
	(path p4-1 s1)
	(path s4 p4-3)
	(path p4-3 s4)
	(path s3 p4-3)
	(path p4-3 s3)
	(path s4 p4-9)
	(path p4-9 s4)
	(path s9 p4-9)
	(path p4-9 s9)
	(path s5 p5-3)
	(path p5-3 s5)
	(path s3 p5-3)
	(path p5-3 s3)
	(path s5 p5-7)
	(path p5-7 s5)
	(path s7 p5-7)
	(path p5-7 s7)
	(path s6 p6-4)
	(path p6-4 s6)
	(path s4 p6-4)
	(path p6-4 s4)
	(path s8 p8-4)
	(path p8-4 s8)
	(path s4 p8-4)
	(path p8-4 s4)
	(path s8 p8-10)
	(path p8-10 s8)
	(path s10 p8-10)
	(path p8-10 s10)
	(path s9 p9-5)
	(path p9-5 s9)
	(path s5 p9-5)
	(path p9-5 s5)
	(path s9 p9-6)
	(path p9-6 s9)
	(path s6 p9-6)
	(path p9-6 s6)
	(path s10 p10-0)
	(path p10-0 s10)
	(path s0 p10-0)
	(path p10-0 s0)
	(path s10 p10-7)
	(path p10-7 s10)
	(path s7 p10-7)
	(path p10-7 s7)
	(link s0 s8)
	(link s8 s0)
	(= (time-to-drive s0 s8) 54)
	(= (time-to-drive s8 s0) 54)
	(link s1 s3)
	(link s3 s1)
	(= (time-to-drive s1 s3) 7)
	(= (time-to-drive s3 s1) 7)
	(link s1 s5)
	(link s5 s1)
	(= (time-to-drive s1 s5) 70)
	(= (time-to-drive s5 s1) 70)
	(link s1 s7)
	(link s7 s1)
	(= (time-to-drive s1 s7) 65)
	(= (time-to-drive s7 s1) 65)
	(link s1 s8)
	(link s8 s1)
	(= (time-to-drive s1 s8) 21)
	(= (time-to-drive s8 s1) 21)
	(link s1 s9)
	(link s9 s1)
	(= (time-to-drive s1 s9) 37)
	(= (time-to-drive s9 s1) 37)
	(link s1 s10)
	(link s10 s1)
	(= (time-to-drive s1 s10) 65)
	(= (time-to-drive s10 s1) 65)
	(link s2 s0)
	(link s0 s2)
	(= (time-to-drive s2 s0) 95)
	(= (time-to-drive s0 s2) 95)
	(link s2 s1)
	(link s1 s2)
	(= (time-to-drive s2 s1) 17)
	(= (time-to-drive s1 s2) 17)
	(link s2 s5)
	(link s5 s2)
	(= (time-to-drive s2 s5) 92)
	(= (time-to-drive s5 s2) 92)
	(link s2 s6)
	(link s6 s2)
	(= (time-to-drive s2 s6) 70)
	(= (time-to-drive s6 s2) 70)
	(link s2 s8)
	(link s8 s2)
	(= (time-to-drive s2 s8) 21)
	(= (time-to-drive s8 s2) 21)
	(link s3 s0)
	(link s0 s3)
	(= (time-to-drive s3 s0) 39)
	(= (time-to-drive s0 s3) 39)
	(link s3 s10)
	(link s10 s3)
	(= (time-to-drive s3 s10) 48)
	(= (time-to-drive s10 s3) 48)
	(link s4 s0)
	(link s0 s4)
	(= (time-to-drive s4 s0) 51)
	(= (time-to-drive s0 s4) 51)
	(link s4 s1)
	(link s1 s4)
	(= (time-to-drive s4 s1) 10)
	(= (time-to-drive s1 s4) 10)
	(link s4 s6)
	(link s6 s4)
	(= (time-to-drive s4 s6) 3)
	(= (time-to-drive s6 s4) 3)
	(link s4 s8)
	(link s8 s4)
	(= (time-to-drive s4 s8) 23)
	(= (time-to-drive s8 s4) 23)
	(link s4 s9)
	(link s9 s4)
	(= (time-to-drive s4 s9) 61)
	(= (time-to-drive s9 s4) 61)
	(link s5 s0)
	(link s0 s5)
	(= (time-to-drive s5 s0) 46)
	(= (time-to-drive s0 s5) 46)
	(link s5 s4)
	(link s4 s5)
	(= (time-to-drive s5 s4) 46)
	(= (time-to-drive s4 s5) 46)
	(link s5 s7)
	(link s7 s5)
	(= (time-to-drive s5 s7) 14)
	(= (time-to-drive s7 s5) 14)
	(link s5 s10)
	(link s10 s5)
	(= (time-to-drive s5 s10) 92)
	(= (time-to-drive s10 s5) 92)
	(link s6 s10)
	(link s10 s6)
	(= (time-to-drive s6 s10) 89)
	(= (time-to-drive s10 s6) 89)
	(link s7 s3)
	(link s3 s7)
	(= (time-to-drive s7 s3) 93)
	(= (time-to-drive s3 s7) 93)
	(link s7 s8)
	(link s8 s7)
	(= (time-to-drive s7 s8) 66)
	(= (time-to-drive s8 s7) 66)
	(link s8 s10)
	(link s10 s8)
	(= (time-to-drive s8 s10) 11)
	(= (time-to-drive s10 s8) 11)
	(link s10 s7)
	(link s7 s10)
	(= (time-to-drive s10 s7) 66)
	(= (time-to-drive s7 s10) 66)
	(link s10 s9)
	(link s9 s10)
	(= (time-to-drive s10 s9) 85)
	(= (time-to-drive s9 s10) 85)
	(= (fuel-used) 0)
)
	(:goal (and
	(at driver1 s10)
	(at driver3 s10)
	(at truck1 s6)
	(at truck2 s7)
	(at truck3 s4)
	(at package2 s8)
	(at package3 s1)
	(at package4 s1)
	(at package5 s2)
	(at package6 s1)
	(at package7 s9)
	(at package8 s8)
	(at package9 s9)
	(at package12 s2)
	(at package13 s8)
	(at package15 s2)
	))

(:metric minimize (+ (* 2 (total-time)) (* 4 (fuel-used))))

)

; plan
1. (board-truck driver1 truck5 s4)
   deleted: (at driver1 s4) (empty truck5)
   added: (driving driver1 truck5)
   goals met: 3 of 16
2. (drive-truck truck5 s4 s1 driver1)
   deleted: (at truck5 s4)
   added: (at truck5 s1)
   changed: (fuel-used) from 0 to 100
   goals met: 3 of 16
3. (load-truck package8 truck5 s1)
   deleted: (at package8 s1)
   added: (in package8 truck5)
   changed: (load truck5) from 0 to 1, (fuel-per-minute truck5) from 10 to 11
   goals met: 3 of 16
4. (board-truck driver3 truck4 s1)
   deleted: (at driver3 s1) (empty truck4)
   added: (driving driver3 truck4)
   goals met: 3 of 16
5. (drive-truck truck4 s1 s10 driver3)
   deleted: (at truck4 s1)
   added: (at truck4 s10)
   changed: (fuel-used) from 100 to 750
   goals met: 3 of 16
6. (disembark-truck driver3 truck4 s10)
   deleted: (driving driver3 truck4)
   added: (at driver3 s10) (empty truck4)
   goals met: 4 of 16
7. (load-truck package9 truck5 s1)
   deleted: (at package9 s1)
   added: (in package9 truck5)
   changed: (load truck5) from 1 to 2, (fuel-per-minute truck5) from 11 to 13
   goals met: 4 of 16
8. (drive-truck truck5 s1 s9 driver1)
   deleted: (at truck5 s1)
   added: (at truck5 s9)
   changed: (fuel-used) from 750 to 1231
   goals met: 4 of 16
9. (unload-truck package9 truck5 s9)
   deleted: (in package9 truck5)
   added: (at package9 s9)
   changed: (load truck5) from 2 to 1, (fuel-per-minute truck5) from 13 to 11
   goals met: 5 of 16
10. (walk driver3 s10 p8-10)
   deleted: (at driver3 s10)
   added: (at driver3 p8-10)
   goals met: 4 of 16
11. (walk driver3 p8-10 s8)
   deleted: (at driver3 p8-10)
   added: (at driver3 s8)
   goals met: 4 of 16
12. (board-truck driver3 truck2 s8)
   deleted: (at driver3 s8) (empty truck2)
   added: (driving driver3 truck2)
   goals met: 4 of 16
13. (disembark-truck driver1 truck5 s9)
   deleted: (driving driver1 truck5)
   added: (at driver1 s9) (empty truck5)
   goals met: 4 of 16
14. (unload-truck package8 truck5 s9)
   deleted: (in package8 truck5)
   added: (at package8 s9)
   changed: (load truck5) from 1 to 0, (fuel-per-minute truck5) from 11 to 10
   goals met: 4 of 16
15. (drive-truck truck2 s8 s4 driver3)
   deleted: (at truck2 s8)
   added: (at truck2 s4)
   changed: (fuel-used) from 1231 to 1461
   goals met: 4 of 16
16. (load-truck package13 truck2 s4)
   deleted: (at package13 s4)
   added: (in package13 truck2)
   changed: (load truck2) from 0 to 1, (fuel-per-minute truck2) from 10 to 11
   goals met: 4 of 16
17. (drive-truck truck2 s4 s1 driver3)
   deleted: (at truck2 s4)
   added: (at truck2 s1)
   changed: (fuel-used) from 1461 to 1571
   goals met: 4 of 16
18. (board-truck driver1 truck1 s9)
   deleted: (at driver1 s9) (empty truck1)
   added: (driving driver1 truck1)
   goals met: 4 of 16
19. (load-truck package8 truck1 s9)
   deleted: (at package8 s9)
   added: (in package8 truck1)
   changed: (load truck1) from 0 to 1, (fuel-per-minute truck1) from 10 to 11
   goals met: 4 of 16
20. (drive-truck truck1 s9 s10 driver1)
   deleted: (at truck1 s9)
   added: (at truck1 s10)
   changed: (fuel-used) from 1571 to 2506
   goals met: 4 of 16
21. (drive-truck truck1 s10 s8 driver1)
   deleted: (at truck1 s10)
   added: (at truck1 s8)
   changed: (fuel-used) from 2506 to 2627
   goals met: 4 of 16
22. (unload-truck package8 truck1 s8)
   deleted: (in package8 truck1)
   added: (at package8 s8)
   changed: (load truck1) from 1 to 0, (fuel-per-minute truck1) from 11 to 10
   goals met: 5 of 16
23. (drive-truck truck1 s8 s2 driver1)
   deleted: (at truck1 s8)
   added: (at truck1 s2)
   changed: (fuel-used) from 2627 to 2837
   goals met: 5 of 16
24. (load-truck package4 truck1 s2)
   deleted: (at package4 s2)
   added: (in package4 truck1)
   changed: (load truck1) from 0 to 1, (fuel-per-minute truck1) from 10 to 11
   goals met: 5 of 16
25. (drive-truck truck1 s2 s6 driver1)
   deleted: (at truck1 s2)
   added: (at truck1 s6)
   changed: (fuel-used) from 2837 to 3607
   goals met: 6 of 16
26. (load-truck package3 truck1 s6)
   deleted: (at package3 s6)
   added: (in package3 truck1)
   changed: (load truck1) from 1 to 2, (fuel-per-minute truck1) from 11 to 13
   goals met: 6 of 16
27. (drive-truck truck1 s6 s10 driver1)
   deleted: (at truck1 s6)
   added: (at truck1 s10)
   changed: (fuel-used) from 3607 to 4764
   goals met: 5 of 16
28. (drive-truck truck2 s1 s8 driver3)
   deleted: (at truck2 s1)
   added: (at truck2 s8)
   changed: (fuel-used) from 4764 to 4995
   goals met: 5 of 16
29. (unload-truck package13 truck2 s8)
   deleted: (in package13 truck2)
   added: (at package13 s8)
   changed: (load truck2) from 1 to 0, (fuel-per-minute truck2) from 11 to 10
   goals met: 6 of 16
30. (drive-truck truck2 s8 s7 driver3)
   deleted: (at truck2 s8)
   added: (at truck2 s7)
   changed: (fuel-used) from 4995 to 5655
   goals met: 7 of 16
31. (load-truck package6 truck2 s7)
   deleted: (at package6 s7)
   added: (in package6 truck2)
   changed: (load truck2) from 0 to 1, (fuel-per-minute truck2) from 10 to 11
   goals met: 7 of 16
32. (drive-truck truck2 s7 s10 driver3)
   deleted: (at truck2 s7)
   added: (at truck2 s10)
   changed: (fuel-used) from 5655 to 6381
   goals met: 6 of 16
33. (drive-truck truck1 s10 s8 driver1)
   deleted: (at truck1 s10)
   added: (at truck1 s8)
   changed: (fuel-used) from 6381 to 6524
   goals met: 6 of 16
34. (drive-truck truck2 s10 s1 driver3)
   deleted: (at truck2 s10)
   added: (at truck2 s1)
   changed: (fuel-used) from 6524 to 7239
   goals met: 6 of 16
35. (unload-truck package6 truck2 s1)
   deleted: (in package6 truck2)
   added: (at package6 s1)
   changed: (load truck2) from 1 to 0, (fuel-per-minute truck2) from 11 to 10
   goals met: 7 of 16
36. (drive-truck truck2 s1 s10 driver3)
   deleted: (at truck2 s1)
   added: (at truck2 s10)
   changed: (fuel-used) from 7239 to 7889
   goals met: 7 of 16
37. (drive-truck truck1 s8 s1 driver1)
   deleted: (at truck1 s8)
   added: (at truck1 s1)
   changed: (fuel-used) from 7889 to 8162
   goals met: 7 of 16
38. (unload-truck package3 truck1 s1)
   deleted: (in package3 truck1)
   added: (at package3 s1)
   changed: (load truck1) from 2 to 1, (fuel-per-minute truck1) from 13 to 11
   goals met: 8 of 16
39. (unload-truck package4 truck1 s1)
   deleted: (in package4 truck1)
   added: (at package4 s1)
   changed: (load truck1) from 1 to 0, (fuel-per-minute truck1) from 11 to 10
   goals met: 9 of 16
40. (drive-truck truck1 s1 s10 driver1)
   deleted: (at truck1 s1)
   added: (at truck1 s10)
   changed: (fuel-used) from 8162 to 8812
   goals met: 9 of 16
41. (drive-truck truck2 s10 s8 driver3)
   deleted: (at truck2 s10)
   added: (at truck2 s8)
   changed: (fuel-used) from 8812 to 8922
   goals met: 9 of 16
42. (drive-truck truck2 s8 s0 driver3)
   deleted: (at truck2 s8)
   added: (at truck2 s0)
   changed: (fuel-used) from 8922 to 9462
   goals met: 9 of 16
43. (load-truck package2 truck2 s0)
   deleted: (at package2 s0)
   added: (in package2 truck2)
   changed: (load truck2) from 0 to 1, (fuel-per-minute truck2) from 10 to 11
   goals met: 9 of 16
44. (drive-truck truck2 s0 s8 driver3)
   deleted: (at truck2 s0)
   added: (at truck2 s8)
   changed: (fuel-used) from 9462 to 10056
   goals met: 9 of 16
45. (unload-truck package2 truck2 s8)
   deleted: (in package2 truck2)
   added: (at package2 s8)
   changed: (load truck2) from 1 to 0, (fuel-per-minute truck2) from 11 to 10
   goals met: 10 of 16
46. (drive-truck truck2 s8 s10 driver3)
   deleted: (at truck2 s8)
   added: (at truck2 s10)
   changed: (fuel-used) from 10056 to 10166
   goals met: 10 of 16
47. (disembark-truck driver1 truck1 s10)
   deleted: (driving driver1 truck1)
   added: (at driver1 s10) (empty truck1)
   goals met: 11 of 16
48. (drive-truck truck2 s10 s5 driver3)
   deleted: (at truck2 s10)
   added: (at truck2 s5)
   changed: (fuel-used) from 10166 to 11086
   goals met: 11 of 16
49. (load-truck package7 truck2 s5)
   deleted: (at package7 s5)
   added: (in package7 truck2)
   changed: (load truck2) from 0 to 1, (fuel-per-minute truck2) from 10 to 11
   goals met: 11 of 16
50. (drive-truck truck2 s5 s10 driver3)
   deleted: (at truck2 s5)
   added: (at truck2 s10)
   changed: (fuel-used) from 11086 to 12098
   goals met: 11 of 16
51. (drive-truck truck2 s10 s9 driver3)
   deleted: (at truck2 s10)
   added: (at truck2 s9)
   changed: (fuel-used) from 12098 to 13033
   goals met: 11 of 16
52. (unload-truck package7 truck2 s9)
   deleted: (in package7 truck2)
   added: (at package7 s9)
   changed: (load truck2) from 1 to 0, (fuel-per-minute truck2) from 11 to 10
   goals met: 12 of 16
53. (drive-truck truck2 s9 s10 driver3)
   deleted: (at truck2 s9)
   added: (at truck2 s10)
   changed: (fuel-used) from 13033 to 13883
   goals met: 12 of 16
54. (board-truck driver1 truck1 s10)
   deleted: (at driver1 s10) (empty truck1)
   added: (driving driver1 truck1)
   goals met: 11 of 16
55. (disembark-truck driver3 truck2 s10)
   deleted: (driving driver3 truck2)
   added: (at driver3 s10) (empty truck2)
   goals met: 12 of 16
56. (drive-truck truck1 s10 s6 driver1)
   deleted: (at truck1 s10)
   added: (at truck1 s6)
   changed: (fuel-used) from 13883 to 14773
   goals met: 13 of 16
57. (board-truck driver3 truck4 s10)
   deleted: (at driver3 s10) (empty truck4)
   added: (driving driver3 truck4)
   goals met: 12 of 16
58. (drive-truck truck4 s10 s9 driver3)
   deleted: (at truck4 s10)
   added: (at truck4 s9)
   changed: (fuel-used) from 14773 to 15623
   goals met: 12 of 16
59. (disembark-truck driver3 truck4 s9)
   deleted: (driving driver3 truck4)
   added: (at driver3 s9) (empty truck4)
   goals met: 12 of 16
60. (board-truck driver3 truck3 s9)
   deleted: (at driver3 s9) (empty truck3)
   added: (driving driver3 truck3)
   goals met: 12 of 16
61. (walk driver2 s0 p10-0)
   deleted: (at driver2 s0)
   added: (at driver2 p10-0)
   goals met: 12 of 16
62. (walk driver2 p10-0 s10)
   deleted: (at driver2 p10-0)
   added: (at driver2 s10)
   goals met: 12 of 16
63. (drive-truck truck1 s6 s10 driver1)
   deleted: (at truck1 s6)
   added: (at truck1 s10)
   changed: (fuel-used) from 15623 to 16513
   goals met: 11 of 16
64. (drive-truck truck3 s9 s4 driver3)
   deleted: (at truck3 s9)
   added: (at truck3 s4)
   changed: (fuel-used) from 16513 to 17123
   goals met: 12 of 16
65. (drive-truck truck3 s4 s6 driver3)
   deleted: (at truck3 s4)
   added: (at truck3 s6)
   changed: (fuel-used) from 17123 to 17153
   goals met: 11 of 16
66. (disembark-truck driver1 truck1 s10)
   deleted: (driving driver1 truck1)
   added: (at driver1 s10) (empty truck1)
   goals met: 12 of 16
67. (board-truck driver2 truck1 s10)
   deleted: (at driver2 s10) (empty truck1)
   added: (driving driver2 truck1)
   goals met: 12 of 16
68. (drive-truck truck1 s10 s6 driver2)
   deleted: (at truck1 s10)
   added: (at truck1 s6)
   changed: (fuel-used) from 17153 to 18043
   goals met: 13 of 16
69. (drive-truck truck3 s6 s10 driver3)
   deleted: (at truck3 s6)
   added: (at truck3 s10)
   changed: (fuel-used) from 18043 to 18933
   goals met: 13 of 16
70. (disembark-truck driver3 truck3 s10)
   deleted: (driving driver3 truck3)
   added: (at driver3 s10) (empty truck3)
   goals met: 14 of 16
71. (board-truck driver1 truck3 s10)
   deleted: (at driver1 s10) (empty truck3)
   added: (driving driver1 truck3)
   goals met: 13 of 16
72. (drive-truck truck3 s10 s9 driver1)
   deleted: (at truck3 s10)
   added: (at truck3 s9)
   changed: (fuel-used) from 18933 to 19783
   goals met: 13 of 16
73. (drive-truck truck3 s9 s4 driver1)
   deleted: (at truck3 s9)
   added: (at truck3 s4)
   changed: (fuel-used) from 19783 to 20393
   goals met: 14 of 16
74. (disembark-truck driver1 truck3 s4)
   deleted: (driving driver1 truck3)
   added: (at driver1 s4) (empty truck3)
   goals met: 14 of 16
75. (board-truck driver3 truck2 s10)
   deleted: (at driver3 s10) (empty truck2)
   added: (driving driver3 truck2)
   goals met: 13 of 16
76. (drive-truck truck2 s10 s7 driver3)
   deleted: (at truck2 s10)
   added: (at truck2 s7)
   changed: (fuel-used) from 20393 to 21053
   goals met: 14 of 16
77. (drive-truck truck1 s6 s10 driver2)
   deleted: (at truck1 s6)
   added: (at truck1 s10)
   changed: (fuel-used) from 21053 to 21943
   goals met: 13 of 16
78. (disembark-truck driver3 truck2 s7)
   deleted: (driving driver3 truck2)
   added: (at driver3 s7) (empty truck2)
   goals met: 13 of 16
79. (walk driver3 s7 p10-7)
   deleted: (at driver3 s7)
   added: (at driver3 p10-7)
   goals met: 13 of 16
80. (walk driver3 p10-7 s10)
   deleted: (at driver3 p10-7)
   added: (at driver3 s10)
   goals met: 14 of 16
81. (walk driver1 s4 p8-4)
   deleted: (at driver1 s4)
   added: (at driver1 p8-4)
   goals met: 14 of 16
82. (walk driver1 p8-4 s8)
   deleted: (at driver1 p8-4)
   added: (at driver1 s8)
   goals met: 14 of 16
83. (drive-truck truck1 s10 s6 driver2)
   deleted: (at truck1 s10)
   added: (at truck1 s6)
   changed: (fuel-used) from 21943 to 22833
   goals met: 15 of 16
84. (walk driver1 s8 p8-10)
   deleted: (at driver1 s8)
   added: (at driver1 p8-10)
   goals met: 15 of 16
85. (walk driver1 p8-10 s10)
   deleted: (at driver1 p8-10)
   added: (at driver1 s10)
   goals met: 16 of 16
